soumya-TI/zephyr/samples/zephyr_foc_motor_control_lvgl/motor_control/universal_launchPad_boosterpack_solutions/3Shunt_Sensorless_FOC_DRV8323RH/am13e2x_som/m33_nortos/3Shunt_Sensorless_FOC_DRV8323RH_am13e2x.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM13E230x" --part "AM13E230x" --package "LQFP64_G" --product "TI MCU SDK@00.01.00.00"
 * @v2CliArgs --device "AM13E23019" --package "LQFP64_G" --product "TI MCU SDK@00.01.00.00"
 * @versions {"tool":"1.26.0+4407"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc         = scripting.addModule("/drivers/adc", {}, false);
const adc1        = adc.addInstance();
const adc2        = adc.addInstance();
const adc3        = adc.addInstance();
const cmpsslite   = scripting.addModule("/drivers/cmpsslite", {}, false);
const cmpsslite1  = cmpsslite.addInstance();
const cmpsslite2  = cmpsslite.addInstance();
const cmpsslite3  = cmpsslite.addInstance();
const cmpsslite4  = cmpsslite.addInstance();
const config      = scripting.addModule("/drivers/config");
const ecap        = scripting.addModule("/drivers/ecap", {}, false);
const ecap1       = ecap.addInstance();
const gpio        = scripting.addModule("/drivers/gpio", {}, false);
const gpio1       = gpio.addInstance();
const gpio2       = gpio.addInstance();
const inputxbar   = scripting.addModule("/drivers/inputxbar", {}, false);
const inputxbar1  = inputxbar.addInstance();
const inputxbar2  = inputxbar.addInstance();
const mcpwm       = scripting.addModule("/drivers/mcpwm", {}, false);
const mcpwm1      = mcpwm.addInstance();
const outputxbar  = scripting.addModule("/drivers/outputxbar", {}, false);
const outputxbar1 = outputxbar.addInstance();
const pwmxbar     = scripting.addModule("/drivers/pwmxbar", {}, false);
const pwmxbar1    = pwmxbar.addInstance();
const pwmxbar2    = pwmxbar.addInstance();
const pwmxbar3    = pwmxbar.addInstance();
const sysctl      = scripting.addModule("/drivers/sysctl");
const uart        = scripting.addModule("/drivers/uart", {}, false);
const uart1       = uart.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                         = "ADC_0";
adc1.seqEndSOC                     = "SOC1";
adc1.interruptPulseMode            = "DL_ADC_PULSE_END_OF_CONV";
adc1.enabledInts                   = ["INT1"];
adc1.enabledSOCs                   = ["SOC0","SOC1"];
adc1.enableSEQs                    = true;
adc1.numberOfSEQs                  = 1;
adc1.INT1.enableInterrupt          = true;
adc1.INT1.continuousMode           = true;
adc1.SOC0.independentNameMode      = true;
adc1.SOC0.channel                  = "DL_ADC_CH_ADCIN12";
adc1.SOC0.name                     = "MTR1_IW_SEN";
adc1.SOC0.peripheral.$assign       = "ANALOG";
adc1.SOC0.peripheral.AIN17.$assign = "PA17";
adc1.SOC1.independentNameMode      = true;
adc1.SOC1.channel                  = "DL_ADC_CH_ADCIN15";
adc1.SOC1.name                     = "MTR1_VU_SEN";
adc1.SOC1.peripheral.$assign       = "ANALOG";
adc1.SOC1.peripheral.AIN16.$assign = "PA16";
adc1.SEQ1.independentNameMode      = true;
adc1.SEQ1.triggerSel               = "DL_ADC_TRIGGER_PWM4_SOCA";

adc2.$name                         = "ADC_1";
adc2.adcBase                       = "ADC1";
adc2.numberOfSEQs                  = 1;
adc2.enabledSOCs                   = ["SOC0","SOC1"];
adc2.enableSEQs                    = true;
adc2.seqEndSOC                     = "SOC1";
adc2.enabledPPBs                   = ["PPB1"];
adc2.SEQ1.triggerSel               = "DL_ADC_TRIGGER_PWM4_SOCA";
adc2.SOC0.independentNameMode      = true;
adc2.SOC0.channel                  = "DL_ADC_CH_ADCIN14";
adc2.SOC0.name                     = "MTR1_IV_SEN";
adc2.SOC0.peripheral.$assign       = "ANALOG";
adc2.SOC0.peripheral.AIN29.$assign = "PA27";
adc2.SOC1.independentNameMode      = true;
adc2.SOC1.channel                  = "DL_ADC_CH_ADCIN12";
adc2.SOC1.name                     = "MTR1_VV_SEN";
adc2.SOC1.peripheral.$assign       = "ANALOG";
adc2.SOC1.peripheral.AIN18.$assign = "PA18";

adc3.$name                         = "ADC_2";
adc3.adcBase                       = "ADC2";
adc3.numberOfSEQs                  = 1;
adc3.enableSEQs                    = true;
adc3.enabledSOCs                   = ["SOC0","SOC1","SOC2"];
adc3.seqEndSOC                     = "SOC2";
adc3.SEQ1.triggerSel               = "DL_ADC_TRIGGER_PWM4_SOCA";
adc3.SEQ1.enableSampleCAPReset     = true;
adc3.SEQ1.sampleWindow             = 50;
adc3.SOC0.independentNameMode      = true;
adc3.SOC0.channel                  = "DL_ADC_CH_ADCIN27";
adc3.SOC0.name                     = "MTR1_IU_SEN";
adc3.SOC0.peripheral.$assign       = "ANALOG";
adc3.SOC0.peripheral.AIN32.$assign = "PA30";
adc3.SOC1.independentNameMode      = true;
adc3.SOC1.channel                  = "DL_ADC_CH_ADCIN30";
adc3.SOC1.name                     = "MTR1_VW_SEN";
adc3.SOC1.peripheral.$assign       = "ANALOG";
adc3.SOC1.peripheral.AIN30.$assign = "PA28";
adc3.SOC2.name                     = "MTR1_VDC_SEN";
adc3.SOC2.channel                  = "DL_ADC_CH_ADCIN17";
adc3.SOC2.independentNameMode      = true;
adc3.SOC2.peripheral.$assign       = "ANALOG";
adc3.SOC2.peripheral.AIN28.$assign = "PA26";

cmpsslite1.cmpssliteBase                     = "CMPSS2";
cmpsslite1.$name                             = "MTR1_CMPSS_U_BASE";
cmpsslite1.useLowComparator                  = false;
cmpsslite1.useFilterLow                      = false;
cmpsslite1.useDACLow                         = false;
cmpsslite1.syncSourceL                       = "DL_CMPSSLITE_SYNCSOURCE_MCPWM4_SYNCPER";
cmpsslite1.highComp.$name                    = "drivers_cmpsslite_v0_cmpsslite_comp0";
cmpsslite1.highComp.tripSourceSelect         = "DL_CMPSSLITE_TRIP_FILTER";
cmpsslite1.highComp.pMuxSel                  = "Input3";
cmpsslite1.highComp.invert                   = true;
cmpsslite1.highComp.peripheral.$assign       = "ANALOG";
cmpsslite1.highComp.peripheral.AIN32.$assign = "PA30";
cmpsslite1.highFilter.$name                  = "drivers_cmpsslite_v0_cmpsslite_filter0";
cmpsslite1.highFilter.initFilter             = true;
cmpsslite1.highFilter.threshold              = 8;
cmpsslite1.highFilter.sampleWindow           = 8;
cmpsslite1.highFilter.samplePrescale         = 1;
cmpsslite1.highFilter.asyncEnable            = true;
cmpsslite1.highFilter.latchReset             = true;
cmpsslite1.highDAC.$name                     = "drivers_cmpsslite_v0_cmpsslite_dac0";
cmpsslite1.highDAC.initialDacValue           = 1800;

cmpsslite2.$name                             = "MTR1_CMPSS_V_BASE";
cmpsslite2.cmpssliteBase                     = "CMPSS1";
cmpsslite2.useLowComparator                  = false;
cmpsslite2.useFilterLow                      = false;
cmpsslite2.useDACLow                         = false;
cmpsslite2.syncSourceL                       = "DL_CMPSSLITE_SYNCSOURCE_MCPWM4_SYNCPER";
cmpsslite2.highComp.$name                    = "drivers_cmpsslite_v0_cmpsslite_comp1";
cmpsslite2.highComp.pMuxSel                  = "Input2";
cmpsslite2.highComp.tripSourceSelect         = "DL_CMPSSLITE_TRIP_FILTER";
cmpsslite2.highComp.invert                   = true;
cmpsslite2.highComp.peripheral.$assign       = "ANALOG";
cmpsslite2.highComp.peripheral.AIN29.$assign = "PA27";
cmpsslite2.highFilter.$name                  = "drivers_cmpsslite_v0_cmpsslite_filter1";
cmpsslite2.highFilter.initFilter             = true;
cmpsslite2.highFilter.sampleWindow           = 8;
cmpsslite2.highFilter.threshold              = 8;
cmpsslite2.highFilter.samplePrescale         = 1;
cmpsslite2.highFilter.asyncEnable            = true;
cmpsslite2.highFilter.latchReset             = true;
cmpsslite2.highDAC.$name                     = "drivers_cmpsslite_v0_cmpsslite_dac1";
cmpsslite2.highDAC.initialDacValue           = 1800;

